## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.istio-egress will be created
+   resource "helm_release" "istio-egress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-egressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "service.type"
+           value = "ClusterIP"
        }
    }

  # helm_release.istio-ingress will be created
+   resource "helm_release" "istio-ingress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-ingressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubernetes_manifest.argocd-gateway must be replaced
-/+ resource "kubernetes_manifest" "argocd-gateway" {
!       manifest = {
!           metadata   = {
                name      = "argocd"
!               namespace = "cinema" -> "argocd" # forces replacement
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           metadata   = {
!               annotations                = null -> (known after apply)
!               clusterName                = null -> (known after apply)
!               creationTimestamp          = null -> (known after apply)
!               deletionGracePeriodSeconds = null -> (known after apply)
!               deletionTimestamp          = null -> (known after apply)
!               finalizers                 = null -> (known after apply)
!               generateName               = null -> (known after apply)
!               generation                 = null -> (known after apply)
!               labels                     = null -> (known after apply)
!               managedFields              = null -> (known after apply)
                name                       = "argocd"
!               namespace                  = "cinema" -> "argocd"
!               ownerReferences            = null -> (known after apply)
!               resourceVersion            = null -> (known after apply)
!               selfLink                   = null -> (known after apply)
!               uid                        = null -> (known after apply)
            }
!           spec       = {
!               servers  = [
!                   {
!                       bind            = null -> (known after apply)
!                       defaultEndpoint = null -> (known after apply)
!                       name            = null -> (known after apply)
!                       port            = {
                            name       = "http"
!                           targetPort = null -> (known after apply)
                            # (2 unchanged elements hidden)
                        }
!                       tls             = {
!                           caCertificates        = null -> (known after apply)
!                           cipherSuites          = null -> (known after apply)
!                           credentialName        = null -> (known after apply)
!                           maxProtocolVersion    = null -> (known after apply)
!                           minProtocolVersion    = null -> (known after apply)
!                           mode                  = null -> (known after apply)
!                           privateKey            = null -> (known after apply)
!                           serverCertificate     = null -> (known after apply)
!                           subjectAltNames       = null -> (known after apply)
!                           verifyCertificateHash = null -> (known after apply)
!                           verifyCertificateSpki = null -> (known after apply)
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged element hidden)
                    },
!                   {
!                       bind            = null -> (known after apply)
!                       defaultEndpoint = null -> (known after apply)
!                       name            = null -> (known after apply)
!                       port            = {
                            name       = "https"
!                           targetPort = null -> (known after apply)
                            # (2 unchanged elements hidden)
                        }
!                       tls             = {
!                           caCertificates        = null -> (known after apply)
!                           cipherSuites          = null -> (known after apply)
!                           httpsRedirect         = null -> (known after apply)
!                           maxProtocolVersion    = null -> (known after apply)
!                           minProtocolVersion    = null -> (known after apply)
!                           subjectAltNames       = null -> (known after apply)
!                           verifyCertificateHash = null -> (known after apply)
!                           verifyCertificateSpki = null -> (known after apply)
                            # (4 unchanged elements hidden)
                        }
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # kubernetes_manifest.virtualservice_resource must be replaced
-/+ resource "kubernetes_manifest" "virtualservice_resource" {
!       manifest = {
!           metadata   = {
                name      = "argocd"
!               namespace = "cinema" -> "argocd" # forces replacement
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           metadata   = {
!               annotations                = null -> (known after apply)
!               clusterName                = null -> (known after apply)
!               creationTimestamp          = null -> (known after apply)
!               deletionGracePeriodSeconds = null -> (known after apply)
!               deletionTimestamp          = null -> (known after apply)
!               finalizers                 = null -> (known after apply)
!               generateName               = null -> (known after apply)
!               generation                 = null -> (known after apply)
!               labels                     = null -> (known after apply)
!               managedFields              = null -> (known after apply)
                name                       = "argocd"
!               namespace                  = "cinema" -> "argocd"
!               ownerReferences            = null -> (known after apply)
!               resourceVersion            = null -> (known after apply)
!               selfLink                   = null -> (known after apply)
!               uid                        = null -> (known after apply)
            }
!           spec       = {
!               exportTo = null -> (known after apply)
!               http     = [
!                   {
!                       corsPolicy       = {
!                           allowCredentials = null -> (known after apply)
!                           allowHeaders     = null -> (known after apply)
!                           allowMethods     = null -> (known after apply)
!                           allowOrigin      = null -> (known after apply)
!                           allowOrigins     = null -> (known after apply)
!                           exposeHeaders    = null -> (known after apply)
!                           maxAge           = null -> (known after apply)
                        }
!                       delegate         = {
!                           name      = null -> (known after apply)
!                           namespace = null -> (known after apply)
                        }
!                       directResponse   = {
!                           body   = {
!                               bytes  = null -> (known after apply)
!                               string = null -> (known after apply)
                            }
!                           status = null -> (known after apply)
                        }
!                       fault            = {
!                           abort = {
!                               grpcStatus = null -> (known after apply)
!                               http2Error = null -> (known after apply)
!                               httpStatus = null -> (known after apply)
!                               percentage = {
!                                   value = null -> (known after apply)
                                }
                            }
!                           delay = {
!                               exponentialDelay = null -> (known after apply)
!                               fixedDelay       = null -> (known after apply)
!                               percent          = null -> (known after apply)
!                               percentage       = {
!                                   value = null -> (known after apply)
                                }
                            }
                        }
!                       headers          = {
!                           request  = {
!                               add    = null -> (known after apply)
!                               remove = null -> (known after apply)
!                               set    = null -> (known after apply)
                            }
!                           response = {
!                               add    = null -> (known after apply)
!                               remove = null -> (known after apply)
!                               set    = null -> (known after apply)
                            }
                        }
!                       match            = [
!                           {
!                               authority       = {
!                                   exact  = null -> (known after apply)
!                                   prefix = null -> (known after apply)
!                                   regex  = null -> (known after apply)
                                }
!                               gateways        = null -> (known after apply)
!                               headers         = null -> (known after apply)
!                               ignoreUriCase   = null -> (known after apply)
!                               method          = {
!                                   exact  = null -> (known after apply)
!                                   prefix = null -> (known after apply)
!                                   regex  = null -> (known after apply)
                                }
!                               name            = null -> (known after apply)
!                               port            = null -> (known after apply)
!                               queryParams     = null -> (known after apply)
!                               scheme          = {
!                                   exact  = null -> (known after apply)
!                                   prefix = null -> (known after apply)
!                                   regex  = null -> (known after apply)
                                }
!                               sourceLabels    = null -> (known after apply)
!                               sourceNamespace = null -> (known after apply)
!                               statPrefix      = null -> (known after apply)
!                               uri             = {
!                                   exact  = null -> (known after apply)
!                                   regex  = null -> (known after apply)
                                    # (1 unchanged element hidden)
                                }
!                               withoutHeaders  = null -> (known after apply)
                            },
                        ]
!                       mirror           = {
!                           host   = null -> (known after apply)
!                           port   = {
!                               number = null -> (known after apply)
                            }
!                           subset = null -> (known after apply)
                        }
!                       mirrorPercent    = null -> (known after apply)
!                       mirrorPercentage = {
!                           value = null -> (known after apply)
                        }
!                       mirror_percent   = null -> (known after apply)
!                       name             = null -> (known after apply)
!                       redirect         = {
!                           authority    = null -> (known after apply)
!                           derivePort   = null -> (known after apply)
!                           port         = null -> (known after apply)
!                           redirectCode = null -> (known after apply)
!                           scheme       = null -> (known after apply)
!                           uri          = null -> (known after apply)
                        }
!                       retries          = {
!                           attempts              = null -> (known after apply)
!                           perTryTimeout         = null -> (known after apply)
!                           retryOn               = null -> (known after apply)
!                           retryRemoteLocalities = null -> (known after apply)
                        }
!                       rewrite          = {
!                           authority = null -> (known after apply)
!                           uri       = null -> (known after apply)
                        }
!                       route            = [
!                           {
!                               destination = {
!                                   subset = null -> (known after apply)
                                    # (2 unchanged elements hidden)
                                }
!                               headers     = {
!                                   request  = {
!                                       add    = null -> (known after apply)
!                                       remove = null -> (known after apply)
!                                       set    = null -> (known after apply)
                                    }
!                                   response = {
!                                       add    = null -> (known after apply)
!                                       remove = null -> (known after apply)
!                                       set    = null -> (known after apply)
                                    }
                                }
!                               weight      = null -> (known after apply)
                            },
                        ]
!                       timeout          = null -> (known after apply)
                    },
                ]
!               tcp      = null -> (known after apply)
!               tls      = null -> (known after apply)
                # (2 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
